using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Main
{
    public partial class Help : Form
    {
        public Help()
        {
            InitializeComponent();
            textBoxHelp.Text = "Функція/операція	                Приклад\n\r\r" +
                                "\na+b (додавання)	                x+2\n\r"+
                                "\na-b (віднімання)	                x-y\n\r" +
                                "\na×b (множення)	                2*x\n\r" +
                                "\na÷b (ділення)	                y / 2\n\r" +
                                "\na^b(піднесення до степеня)	    x^4\n\r" +
                                "\n( ) (дужки)	                    (x+1)*(x-2)\n\r" +
                                "\n[a] (ціла частина числа a)	    [x+y]\n\r" +
                                "\n{a} (дробова частина числа a)	{y+0.5}\n\r" +
                                "\n√a (квадратний корінь числа a)	sqrt(4)\n\r" +
                                "\n|a| (модуль числа а)	            abs(x+2)\n\r" +
                                "\n       sin ⁡a	                    sin⁡(x)\n\r" +
                                "\n       cos ⁡a	                    cos⁡(x*y+2)\n\r" +
                                "\n       tg a	                    tg(x)\n\r" +
                                "\n       ctg a	                    ctg(y)\n\r" +
                                "\n       arcsin⁡a	                arcsin⁡(x+100)\n\r" +
                                "\n       arccos⁡a	                arccos⁡(2*x)\n\r" +
                                "\n       arctg a	                arctg⁡(x-3)\n\r" +
                                "\n       arcctg a	                arcctg⁡(x/y)\n\r" +
                                "\n       ln⁡a	                    ln⁡([x])\n\r" +
                                "\n       lg⁡a	                    lg⁡(x+y)\n\r" +
                                "\n       =	                        [x]={y}\n\r" +
                                "\n       <	                        [x]<{y}\n\r" +
                                "\n       ≤	                        [x]<={y}\n\r" +
                                "\n       >	                        [x]>{y}\n\r" +
                                "\n       ≥	                        [x]>={y}\n\r\n\r" +
                                "\n\nДля побудови графіка функції y=[f(x)] спочатку потрібно в поле вводу в програмі ввести функцію y=f(x), потім натиснути на кнопку F1. Після цього можна буде спостерігати, як з графіка функції y=f(x) можна одержати графік функції y=[f(x)], використовуючи алгоритм побудови відповідного графіка\n\r\n\r" +
                                "\n\nДля побудови графіка функції y={f(x)} спочатку потрібно в поле вводу в програмі ввести функцію y=f(x), потім натиснути на кнопку F2. Після цього можна буде спостерігати, як з графіка функції y=f(x) можна одержати графік функції y={f(x)}, використовуючи алгоритм побудови відповідного графіка\n\r\n\r" +
                                "\n\nДля побудови графіка функції y=f([x]) спочатку потрібно в поле вводу в програмі ввести функцію y=f(x), потім натиснути на кнопку F3. Після цього можна буде спостерігати, як з графіка функції y=f(x) можна одержати графік функції y=f([x]), використовуючи алгоритм побудови відповідного графіка\n\r\n\r" +
                                "\n\nДля побудови графіка функції y=f({x}) спочатку потрібно в поле вводу в програмі ввести функцію y=f(x), потім натиснути на кнопку F4. Після цього можна буде спостерігати, як з графіка функції y=f(x) можна одержати графік функції y=f({x}), використовуючи алгоритм побудови відповідного графіка\n\r\n\r";

        }

        private void textBox1_TextChanged(object sender, EventArgs e)
        {

        }
    }
}
